import { object, string, number, } from 'yup'

const infosValidation = object().shape({
    firstname: string()
        .min(2, 'نام شما باید بیشتر از ۲ کلمه باشد')
        .max(12, 'نام شما باید کمتر از ۱۲ کلمه باشد')
        .required('وارد کردن نام اجباری میباشد'),
    lastname: string()
        .min(5, 'فامیلی شما باید بیشتر از ۵ کلمه باشد')
        .max(12, 'فامیلی شما باید کمتر از ۱۲ کلمه باشد')
        .required('وارد کردن فامیلی اجباری میباشد'),
    username: string()
        .min(5, 'نام کاربری باید بیشتر از ۵  کلمه باشد')
        .max(12, 'نام کاربری باید کمتر از ۱۲ کلمه باشد')
        .required('وارد کردن نام کاربری اجاری میباشد'),
    email: string()
        .email('ایمیل شما نامعتبر میباشد')
        .min(10, 'ایمیل شما باید بیشتر از ۱۰ کلمه باشد')
        .max(30, 'ایمیل شما باید کمتر از ۳۰ کلمه باشد')
        .required('وارد کردن ایمیل اجباری میباشد'),
    city: string()
        .max(12, 'نام شهر شما باید کمتر از ۱۲ کلمه باشد')
        .required('وارد کردن شهر اجباری میباشد'),
    age: number()
        .typeError('نام خود را به صورت عدد وارد کنید')
        .min(19, 'سن شما باید بیشتر از  18 باشد')
        .max(100, 'سن شما باید کمتر از ۳ زقم باشد')
        .required('وارد کردن سن اجباری میباشد'),

})


export default infosValidation;